jstools.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Javascript Static Analysis Tools</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Javascript Static Analysis Tools"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-15T22:54+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Javascript Static Analysis Tools</h1>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Coding Standard Enforcement</a>
<ul>
<li><a href="#sec-1-1">1.1 JSLint</a></li>
<li><a href="#sec-1-2">1.2 JSHint</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Simple static analysis based on some extensible tools</a>
<ul>
<li><a href="#sec-2-1">2.1 DoctorJS</a></li>
<li><a href="#sec-2-2">2.2 PHP CodeSniffer</a></li>
<li><a href="#sec-2-3">2.3 pfff</a></li>
<li><a href="#sec-2-4">2.4 WALA</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Duplicated Code</a>
<ul>
<li><a href="#sec-3-1">3.1 CloneDR</a></li>
<li><a href="#sec-3-2">3.2 CPD</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Not so sure</a>
<ul>
<li><a href="#sec-4-1">4.1 JSure</a></li>
<li><a href="#sec-4-2">4.2 JSAnalyse</a></li>
<li><a href="#sec-4-3">4.3 pyv8</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Google Closure</a></li>
<li><a href="#sec-6">6 Theoretic Works</a>
<ul>
<li><a href="#sec-6-1">6.1 TAJS</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Coding Standard Enforcement</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> JSLint</h3>
<div class="outline-text-3" id="text-1-1">

<p>   It ships with a great default ruleset. JSLint is highly opinionated and this is generally seen as a good thing. Thus there's (intentionally) a limited amount you can do to configure or disable individual rules. But this can make it tough to apply JSLint to legacy code.  
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> JSHint</h3>
<div class="outline-text-3" id="text-1-2">

<p>   JSHint is very similar to JSLint but it is easier/possible to configure or disable all of JSLint's checks via command line options or via a .jshintrc file.
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Simple static analysis based on some extensible tools</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> DoctorJS</h3>
<div class="outline-text-3" id="text-2-1">

<p>   <a href="http://doctorjs.org/">http://doctorjs.org/</a>
   not avaiable right now?
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> PHP CodeSniffer</h3>
<div class="outline-text-3" id="text-2-2">

<p>   PHP CodeSniffer with javascript
   <a href="https://gist.github.com/textarcana/3375708#file_js_code_sniffs.md">https://gist.github.com/textarcana/3375708#file_js_code_sniffs.md</a>
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> pfff</h3>
<div class="outline-text-3" id="text-2-3">

<p>   parsing, hacky global analysis for callgraphs, highlighter, hacky class analysis, semantic visual feedback in codemap (important function/classes/methods)
   <a href="https://github.com/facebook/pfff">https://github.com/facebook/pfff</a>
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> WALA</h3>
<div class="outline-text-3" id="text-2-4">

<p>   <a href="http://wala.sourceforge.net/wiki/index.php/Tutorial">http://wala.sourceforge.net/wiki/index.php/Tutorial</a>
   WALA is an open-source program analysis framework that can build static call graphs and control-flow graphs for JavaScript:
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Duplicated Code</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> CloneDR</h3>
<div class="outline-text-3" id="text-3-1">

<p>   detect duplicated code
   <a href="http://www.semanticdesigns.com/Products/Clone/ECMAScriptExample/index.html">http://www.semanticdesigns.com/Products/Clone/ECMAScriptExample/index.html</a>
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> CPD</h3>
<div class="outline-text-3" id="text-3-2">

<p>   <a href="http://pmd.sourceforge.net/">http://pmd.sourceforge.net/</a>  
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Not so sure</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> JSure</h3>
<div class="outline-text-3" id="text-4-1">

<p>   <a href="https://github.com/berke/jsure">https://github.com/berke/jsure</a>
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> JSAnalyse</h3>
<div class="outline-text-3" id="text-4-2">

<p>   JSAnalyse has just been published on codeplex. It is a tool which analyses the dependencies between javascript files. You can even define the allowed dependencies and JSAnalysis checks whether the defined rules are fulfilled or not. That allows to keep track about the javascript dependencies even in big projects and have a clean architecture.
   <a href="http://jsanalyse.codeplex.com/">http://jsanalyse.codeplex.com/</a>
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> pyv8</h3>
<div class="outline-text-3" id="text-4-3">

<p>   Python Wrapper for Google V8 Javascript Engine. Potentially, we can customize V8 to collect runtime information.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Google Closure</h2>
<div class="outline-text-2" id="text-5">

<p>  Closure compiler can be used to detect javascript errors. It also warns you about potential issues such as missing parameters and undeclared or redefined variables. 
  Complete list of errors and warnings can be found at: <a href="https://developers.google.com/closure/compiler/docs/error-ref">https://developers.google.com/closure/compiler/docs/error-ref</a>
</p>
<p>
  Closure can output ast in .dot format and use Graphviz to visualize call graph.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Theoretic Works</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <span class="todo TODO">TODO</span> TAJS</h3>
<div class="outline-text-3" id="text-6-1">


<p>  
   <a href="http://www.brics.dk/TAJS/">http://www.brics.dk/TAJS/</a>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
